//const create = require('loopback-connector-firestore').create;

module.exports = function(app) {
    app.dataSources.firestore.automigrate('Route', function(err) {
        if (err) throw err;

        app.models.Route.create([
            {direction: 0, type: "tram", number:  "1", name: "ДС Зеленый Луг - пл. Мясникова",      stops: [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22 ]},
            {direction: 0, type: "tram", number:  "3", name: "ДС Озеро - ДС Серебрянка",            stops: [ 23, 24, 25, 26, 27, 28, 29, 30, 13, 14, 15, 46, 45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31 ]},
            {direction: 0, type: "tram", number:  "4", name: "ДС Озеро - пл. Мясникова",            stops: [ 23, 24, 25, 26, 27, 28, 29, 30, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22 ]},
            {direction: 0, type: "tram", number:  "5", name: "ДС Озеро - ДС Зеленый Луг",           stops: [ 23, 24, 25, 26, 27, 28, 29, 30, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0 ]},
            {direction: 0, type: "tram", number:  "6", name: "ДС Серебрянка - ДС Зеленый Луг",      stops: [ 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 50, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0 ]},
            {direction: 0, type: "tram", number:  "7", name: "ДС Серебрянка - пл. Мясникова",       stops: [ 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 16, 17, 18, 19, 20, 21, 22 ]},
            {direction: 0, type: "tram", number:  "9", name: "ДС Серебрянка - Тракторный Завод",    stops: [ 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 48 ]},
            {direction: 0, type: "tram", number: "11", name: "ДС Зеленый Луг - пр-т Независимости", stops: [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 49 ]},
            {direction: 0, type: "bus" , number: "21", name: "ДС Зеленый Луг - пл. Мясникова",      stops: [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22 ]},
            {direction: 0, type: "bus" , number: "43", name: "ДС Озеро - ДС Серебрянка",            stops: [ 23, 24, 25, 26, 27, 28, 29, 30, 13, 14, 15, 46, 45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31 ]},
            {direction: 0, type: "trol", number: "31", name: "ДС Зеленый Луг - пл. Мясникова",      stops: [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22 ]},
            {direction: 0, type: "trol", number: "53", name: "ДС Озеро - ДС Серебрянка",            stops: [ 23, 24, 25, 26, 27, 28, 29, 30, 13, 14, 15, 46, 45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31 ]},
            {direction: 0, type: "undr", number:  "2", name: "ДС Зеленый Луг - пл. Мясникова",      stops: [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22 ]},
            {direction: 0, type: "undr", number:  "3", name: "ДС Озеро - ДС Серебрянка",            stops: [ 23, 24, 25, 26, 27, 28, 29, 30, 13, 14, 15, 46, 45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31 ]},
            {direction: 1, type: "tram", number:  "1", name: "пл. Мясникова - ДС Зеленый Луг",      stops: [ 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0 ]},
            {direction: 1, type: "tram", number:  "3", name: "ДС Серебрянка  - ДС Озеро",           stops: [ 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 15, 14, 13, 23, 24, 25, 26, 27, 28, 29, 30 ]},
            {direction: 1, type: "tram", number:  "4", name: "пл. Мясникова - ДС Озеро",            stops: [ 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 30, 29, 28, 27, 26, 25, 24, 23 ]},
            {direction: 1, type: "tram", number:  "5", name: "ДС Зеленый Луг - ДС Озеро",           stops: [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 30, 29, 28, 27, 26, 25, 24, 23 ]},
            {direction: 1, type: "tram", number:  "6", name: "ДС Зеленый Луг - ДС Серебрянка",      stops: [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 50, 45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31 ]},
            {direction: 1, type: "tram", number:  "7", name: "пл. Мясникова - ДС Серебрянка",       stops: [ 22, 21, 20, 19, 18, 17, 16, 47, 46, 45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31 ]},
            {direction: 1, type: "tram", number:  "9", name: "Тракторный Завод - ДС Серебрянка",    stops: [ 48, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31 ]},
            {direction: 1, type: "tram", number: "11", name: "пр-т Независимости - ДС Зеленый Луг", stops: [ 49, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0 ]},
            {direction: 1, type: "bus" , number: "21", name: "пл. Мясникова - ДС Зеленый Луг",      stops: [ 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0 ]},
            {direction: 1, type: "bus" , number: "43", name: "ДС Серебрянка  - ДС Озеро",           stops: [ 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 15, 14, 13, 23, 24, 25, 26, 27, 28, 29, 30 ]},
            {direction: 1, type: "trol", number: "31", name: "пл. Мясникова - ДС Зеленый Луг",      stops: [ 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0 ]},
            {direction: 1, type: "trol", number: "53", name: "ДС Серебрянка  - ДС Озеро",           stops: [ 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 15, 14, 13, 23, 24, 25, 26, 27, 28, 29, 30 ]},
            {direction: 1, type: "undr", number:  "2", name: "пл. Мясникова - ДС Зеленый Луг",      stops: [ 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0 ]},
            {direction: 1, type: "undr", number:  "3", name: "ДС Серебрянка  - ДС Озеро",           stops: [ 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 15, 14, 13, 23, 24, 25, 26, 27, 28, 29, 30 ]}
        ], function(err, Route) {
            if (err) throw err;
            console.log('Models created: \n', Route);
        });
    });
    app.dataSources.firestore.automigrate('Stop', function(err) {
        if (err) throw err;

        app.models.Stop.create([
            {name: "ДС Зеленый Луг",           routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Седых",                    routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Калиновского",             routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Магазин Электроника",      routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Севастопольская",          routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Волгоградская",            routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Белинского",               routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Ломоносова",               routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Чернышевского",            routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "БНТУ",                     routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Дорошевича",               routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Площадь Якуба Коласа",     routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Пугачевская",              routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 3, 17, 4, 18, 7, 21 ] },
            {name: "Красная",                  routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 1, 15, 2, 16, 4, 18, 7, 21 ] },
            {name: "Проспект Независимости",   routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 1, 15, 2, 16, 4, 18, 7, 21 ] },
            {name: "Змитрока Бядули",          routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 1, 15, 2, 16, 4, 18 ] },
            {name: "Захарова",                 routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 5, 19 ] },
            {name: "Парк Горького",            routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 5, 19 ] },
            {name: "Лицей БГУ",                routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 5, 19 ] },
            {name: "Стадион Динамо",           routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 5, 19 ] },
            {name: "Свердлова",                routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 5, 19 ] },
            {name: "Вокзал",                   routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 5, 19 ] },
            {name: "ДС Мясникова",             routes: [ 0, 14, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 5, 19 ] },
            {name: "ДС Озеро",                 routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 3, 17 ] },
            {name: "Веры Слуцкой",             routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 3, 17 ] },
            {name: "Старовиленский тракт",     routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 3, 17 ] },
            {name: "Дворец детей и молодежи",  routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 3, 17 ] },
            {name: "Переспа",                  routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 3, 17 ] },
            {name: "Театральная",              routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 3, 17 ] },
            {name: "Богдановича",              routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 3, 17 ] },
            {name: "Куйбышева",                routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 2, 16, 3, 17 ] },
            {name: "ДС Серебрянка",            routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Серебрянка-3",             routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Якубова",                  routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Поликлиника №18",          routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Проспект Рокоссовского",   routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Горовца",                  routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Васнецова",                routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Народная",                 routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Станция Партизанская",     routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Парк 50-летия Октября",    routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Буденого",                 routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Станция Тракторный завод", routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Уральская",                routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Переулок Козлова",         routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Ботаническая",             routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Платонова",                routes: [ 1, 15, 8, 22, 9, 23, 10, 24, 11, 25, 12, 26, 13, 27, 4, 18, 5, 19, 6, 20 ] },
            {name: "Чапаева",                  routes: [ 5, 19 ] },
            {name: "Тракторный завод",         routes: [ 6, 20 ] },
            {name: "Проспект Независимости",   routes: [ 7, 21 ] },
            {name: "Берестянская",             routes: [ 4, 18 ] }
        ], function(err, Stop) {
            if (err) throw err;
            console.log('Models created: \n', Stop);
        });
    });
}